src/test/artillery/flow.yaml
config:
  pluggins:
    metrics-by-endpoint : {}
  target: http://localhost:8080/api
  phases:
    - duration: 10
      arrivalRate: 50
scenarios:
  - name: login
    flow:
      - log: login
      - post: 
          url: /sessions/login
          json:
            email: eservetti2018@gmail.com
            password: "1011"
      - log: read all products
      - get:
          url: /products
      - log: create a cart
      - post:
          url: /carts
          json:
            product_id: 6684501acfbcff73d405d89d
            quantity: 1
      - log: logout
      - post:
          url: /sessions/signout